notebook/ligeti.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Ligeti: a process-music composition system</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-02 19:51:42 EDT"/>
<meta name="author" content="David O'Toole"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href="/eon.css" type="text/css"/><link href='http://fonts.googleapis.com/css?family=Ubuntu:regular,italic,bold' rel='stylesheet' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Ligeti: a process-music composition system</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Status </h2>
<div class="outline-text-2" id="text-1">


<p>
 <b>2007-05-20</b> &ndash; I'm close to completing an 0.9 release.  You can
check out <a href="http://dto.freeshell.org/e/ligeti.el">http://dto.freeshell.org/e/ligeti.el</a> but it is not usable
yet. I need to write the GUI using cell-mode&hellip;
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">About </h2>
<div class="outline-text-2" id="text-2">


<p>
Ligeti is a system for the composition of <a href="http://en.wikipedia.org/wiki/Process_music">process music</a>. It is named
after the composer <a href="http://en.wikipedia.org/wiki/György_Ligeti">György Ligeti.</a> The musician selects from a library
of audio "activities". An activity is a template for an audio
synthesis process. The activities are arranged into a unified whole
through manual sequencing, automated composition, or a combination of
the two. The piece is then rendered to disk using <a href="http://en.wikipedia.org/wiki/Csound">csound</a>. The user may
create new activities and compositional algorithms.
</p>
<p>
Ligeti and its user interface are
implemented in Emacs Lisp. The
following programs are required:
</p>
<ul>
<li><a href="http://www.gnu.org/software/emacs">GNU Emacs</a> 22.X
</li>
<li>Stéphane Rollandin's <a href="http://www.zogotounga.net/comp/csoundx.html">csound-x for Emacs</a> 
</li>
<li><a href="http://www.csounds.com">csound</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Design </h2>
<div class="outline-text-2" id="text-3">


<ul>
<li>An "activity" is an abstraction of a csound instrument.  Activities
   are represented as lisp functions that produce csound instrument
   definitions suitable for csound-x's orchestra code transcription
   engine. These functions accept full Common Lisp keyword parameter
   lists and are fully documented.

<ul>
<li>(find-function 'csl-transcribe-to-code)

</li>
</ul>

</li>
<li>An "event" is an abstraction of a csound i-statement. It triggers
   an activity, causing it to generate sound. 
</li>
<li>A "sequence" is a set of events taken together as a bundle. These
   are simply lisp lists of events.
</li>
<li>A sequence may also be an event, i.e. the sequence itself is
   triggered at a certain time
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Music concepts </h2>
<div class="outline-text-2" id="text-4">


<ul>
<li>oscillating loops
</li>
<li>drones
</li>
<li>melodic fragments, pointillism
</li>
<li>arhythmic ambient pieces, also technoish stuff
</li>
</ul>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="todo TODO"> TODO</span> ROUGH DRAFT OF LIGETI </h2>
<div class="outline-text-2" id="text-5">

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="todo TODO"> TODO</span> Create a working activity that renders to a working csound document. </h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="done DONE"> DONE</span> Function to create new cell sheets based on a ligeti activity </h3>
<div class="outline-text-3" id="text-6-1">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2007-05-19 Sat 10:26</span></span><br/>
</p></div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="todo TODO"> TODO</span> Test rendering named columns </h3>
<div class="outline-text-3" id="text-6-2">

</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="todo TODO"> TODO</span> header-line docs in cell-mode </h3>
<div class="outline-text-3" id="text-6-3">

</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="todo TODO"> TODO</span> Load project .el file upon startup. </h3>
<div class="outline-text-3" id="text-6-4">

</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="todo TODO"> TODO</span> Ligeti mini mode </h3>
<div class="outline-text-3" id="text-6-5">

</div>

</div>

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="todo TODO"> TODO</span> proper saving and loading of .ligeti.cell sheets </h3>
<div class="outline-text-3" id="text-6-6">

</div>

</div>

<div id="outline-container-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="todo TODO"> TODO</span> Allow "default cell type" that can automatically replace blanks </h3>
<div class="outline-text-3" id="text-6-7">

</div>

</div>

<div id="outline-container-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="todo TODO"> TODO</span> Make the default faces look cool </h3>
<div class="outline-text-3" id="text-6-8">

</div>

</div>

<div id="outline-container-6-9" class="outline-3">
<h3 id="sec-6-9"><span class="todo TODO"> TODO</span> Standardized sexp inlet editing function? </h3>
<div class="outline-text-3" id="text-6-9">

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="todo TODO"> TODO</span> Rendering to csound </h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="done DONE"> DONE</span> activities &ndash;&gt; instruments </h3>
<div class="outline-text-3" id="text-7-1">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2007-05-16 Wed 06:42</span></span><br/>
</p></div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="done DONE"> DONE</span> samples &ndash;&gt; function tables </h3>
<div class="outline-text-3" id="text-7-2">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2007-05-16 Wed 06:42</span></span><br/>
</p></div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="todo TODO"> TODO</span> sequences &ndash;&gt; i-statements </h3>
<div class="outline-text-3" id="text-7-3">

</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="todo TODO"> TODO</span> Dumbek activity </h2>
<div class="outline-text-2" id="text-8">

</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="todo TODO"> TODO</span> Etudes </h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="todo TODO"> TODO</span> Loop a warped sample </h3>
<div class="outline-text-3" id="text-9-1">

</div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="todo TODO"> TODO</span> Write a simple composition with 3 different sounds </h3>
<div class="outline-text-3" id="text-9-2">


</div>

<div id="outline-container-9-2-1" class="outline-4">
<h4 id="sec-9-2-1"><span class="todo TODO"> TODO</span> Drone </h4>
<div class="outline-text-4" id="text-9-2-1">

</div>

</div>

<div id="outline-container-9-2-2" class="outline-4">
<h4 id="sec-9-2-2"><span class="todo TODO"> TODO</span> Flourish </h4>
<div class="outline-text-4" id="text-9-2-2">

</div>

</div>

<div id="outline-container-9-2-3" class="outline-4">
<h4 id="sec-9-2-3"><span class="todo TODO"> TODO</span> Fadeout hum </h4>
<div class="outline-text-4" id="text-9-2-3">


</div>

</div>

<div id="outline-container-9-2-4" class="outline-4">
<h4 id="sec-9-2-4"><span class="todo TODO"> TODO</span> Sample player/looper/distorter </h4>
<div class="outline-text-4" id="text-9-2-4">

</div>
</div>

</div>

<div id="outline-container-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="todo TODO"> TODO</span> Try to compose in elisp </h3>
<div class="outline-text-3" id="text-9-3">


</div>

</div>

<div id="outline-container-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="done DONE"> DONE</span> Email stef about stuff hepta@zogotounga.net </h3>
<div class="outline-text-3" id="text-9-4">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2007-05-07 Mon 08:43</span></span>       <br/>
</p></div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">Algorithmic composition </h2>
<div class="outline-text-2" id="text-10">

<ul>
<li><a href="http://www.flexatone.net/algoNet/">http://www.flexatone.net/algoNet/</a>
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2011-08-02 19:51:42 EDT</p>
<p class="author">Author: David O'Toole</p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
